package console

import (
	"fmt"
	"log"
)

// ShowGreeting - функция вывода привествия для пользователя
func ShowGreeting() {

	_, error := fmt.Println(`
		 __________________________________________
		|________________ nextBOT _________________|
		|______________________ на нейронных сетях |
		|__________________________________________|
		|__________________________ Lazarenko A.A. |
		|__________________________________________|
	`)

	if error != nil {
		log.Fatal(error)
	}

}

// ShowInfo - функция вывода прощания для пользователя
func ShowInfo() {

	_, error := fmt.Println(`
		 __________________________________________
		|_________________ INFO: __________________|
		|________ Напишите "!bye" для выхода. _____|
		|__________________________________________|
	`)

	if error != nil {
		log.Fatal(error)
	}

}

// ShowFarewell - функция вывода прощания для пользователя
func ShowFarewell() {

	_, error := fmt.Println(`
		 __________________________________________
		|________________ GOODBYE :-) _____________|
		|__________________________________________|
		|__ Я закрою это окно через одну секунду. _|
		|__________________________________________|
	`)

	if error != nil {
		log.Fatal(error)
	}

}

// ShowFirstTrainStart - функция вывода сообщения о начала первого обучения
func ShowFirstTrainStart() {

	_, error := fmt.Println(`
		 __________________________________________
		|___ Запущено обучение нейронных сетей. ___|
		|__________________________________________|
	`)

	if error != nil {
		log.Fatal(error)
	}

}

// ShowFirstTrainEnd - функция вывода сообщения об окончании первого обучения
func ShowFirstTrainEnd() {

	_, error := fmt.Println(`
		 __________________________________________
		|___ Закончено обучение нейронных сетей. __|
		|__________________________________________|
	`)

	if error != nil {
		log.Fatal(error)
	}

}
