package console

import (
	"fmt"
	"log"
)

// ShowGreeting - функция вывода привествия для пользователя
func ShowGreeting() {

	_, error := fmt.Println(`
		 __________________________________________
		|________________ nextBOT _________________|
		|______________________ on neural networks |
		|__________________________________________|
		|__________________________ Lazarenko A.A. |
		|__________________________________________|
	`)

	if error != nil {
		log.Fatal(error)
	}

}

// ShowInfo - функция вывода прощания для пользователя
func ShowInfo() {

	_, error := fmt.Println(`
		 __________________________________________
		|_________________ INFO: __________________|
		|__________ Write "!BYE" to exit __________|
		|__________________________________________|
	`)

	if error != nil {
		log.Fatal(error)
	}

}

// ShowFarewell - функция вывода прощания для пользователя
func ShowFarewell() {

	_, error := fmt.Println(`
		 __________________________________________
		|________________ GOODBYE :-) _____________|
		|__________________________________________|
		|___ I'll close the window in 2 seconds ___|
		|__________________________________________|
	`)

	if error != nil {
		log.Fatal(error)
	}

}
